ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/slcl_ecp.c
/*
 *  Elliptic curves over GF(p): CRYPTO hw acceleration functions
 *
 *  Copyright (C) 2016, Silicon Labs, http://www.silabs.com
 *  SPDX-License-Identifier: Apache-2.0
 *
 *  Licensed under the Apache License, Version 2.0 (the "License"); you may
 *  not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */
/*
 * This file includes alternative plugin implementations of various
 * functions in ecp.c using the CRYPTO hardware accelerator incorporated
 * in MCU devices from Silicon Laboratories.
 */
/*
 * References:
 *
 * SEC1 http://www.secg.org/index.php?action=secg,docs_secg
 * GECC = Guide to Elliptic Curve Cryptography - Hankerson, Menezes, Vanstone
 * FIPS 186-3 http://csrc.nist.gov/publications/fips/fips186-3/fips_186-3.pdf
 * RFC 4492 for the related TLS structures and constants
 *
 * [Curve25519] http://cr.yp.to/ecdh/curve25519-20060209.pdf
 *
 * [2] CORON, Jean-S'ebastien. Resistance against differential power analysis
 *     for elliptic curve cryptosystems. In : Cryptographic Hardware and
 *     Embedded Systems. Springer Berlin Heidelberg, 1999. p. 292-302.
 *     <http://link.springer.com/chapter/10.1007/3-540-48059-5_25>
 *
 * [3] HEDABOU, Mustapha, PINEL, Pierre, et B'EN'ETEAU, Lucien. A comb method to
 *     render ECC resistant against Side Channel Attacks. IACR Cryptology
 *     ePrint Archive, 2004, vol. 2004, p. 342.
 *     <http://eprint.iacr.org/2004/342.pdf>
 */

#if !defined(MBEDTLS_CONFIG_FILE)
#include "mbedtls/config.h"
#else
#include MBEDTLS_CONFIG_FILE
#endif

#if defined( MBEDTLS_ECP_C )

#if defined( MBEDTLS_ECP_DEVICE_ALT )

#if defined( MBEDTLS_SLCL_PLUGINS )

#include "em_device.h"

#if defined( CRYPTO_COUNT ) && ( CRYPTO_COUNT > 0 )

#include "mbedtls/ecp.h"
#include "cryptodrv_internal.h"
#include "em_crypto.h"
#include <stdbool.h>
#include <string.h>

#if defined(MBEDTLS_PLATFORM_C)
#include "mbedtls/platform.h"
#else
#include <stdlib.h>
#include <stdio.h>
#define mbedtls_printf     printf
#define mbedtls_calloc    calloc
#define mbedtls_free       free
#endif

/** ECC big integer type. */
#define ECC_BIGINT_SIZE_IN_BITS        (256)
#define ECC_BIGINT_SIZE_IN_BYTES       (ECC_BIGINT_SIZE_IN_BITS/8)
#define ECC_BIGINT_SIZE_IN_32BIT_WORDS (ECC_BIGINT_SIZE_IN_BYTES/sizeof(uint32_t))
#define EC_BIGINT_COPY(X, Y) memcpy(X, Y, sizeof(ecc_bigint_t));
typedef uint32_t ecc_bigint_t[ECC_BIGINT_SIZE_IN_32BIT_WORDS];

#if defined(MBEDTLS_MPI_MODULAR_DIVISION_ALT)
#define MPI_TO_BIGINT(bigint, mpi) mpitobigint(bigint, mpi);

/***************************************************************************//**
 * @brief
 *   Convert an mpi number representation to a 32bit word array used by crypto.
 ******************************************************************************/
__STATIC_INLINE void mpitobigint( ecc_bigint_t bigint, const mbedtls_mpi* mpi )
{
    uint32_t* bi = bigint;
    
    if ( mpi->n < 8 )
    {
      memcpy(bigint, mpi->p, mpi->n * sizeof(uint32_t));
      memset(&bi[mpi->n], 0, sizeof(ecc_bigint_t) - mpi->n * sizeof(uint32_t));
    }
    else
    {
      memcpy(bigint, mpi->p, 8 * sizeof(uint32_t));
    }
}

/***************************************************************************//**
 * @brief
 *   Returns true if the value of the DDATA0 register is equal to zero.
 ******************************************************************************/
__STATIC_INLINE bool crypto_ddata0_is_zero(CRYPTO_TypeDef* crypto,
                                           uint32_t*       status_reg)
{
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_CCLR,
                   CRYPTO_CMD_INSTR_DEC,  /* Decrement by one which will set
                                             carry bit if DDATA0 is zero. */
                   CRYPTO_CMD_INSTR_INC   /* Increment in order to restore
                                             original value. */
                   );

  *status_reg = crypto->DSTATUS;

  return (*status_reg & CRYPTO_DSTATUS_CARRY) == CRYPTO_DSTATUS_CARRY;
}
#endif

#if defined( MBEDTLS_ECP_GROUP_INIT_ALT )
/*
 * Initialize (the components of) a group
 */
void mbedtls_ecp_group_init( mbedtls_ecp_group *grp )
{
    if( grp == NULL )
        return;

    memset( grp, 0, sizeof( mbedtls_ecp_group ) );
}
#endif /* #if !defined( MBEDTLS_ECP_GROUP_INIT_ALT ) */

#if defined( MBEDTLS_ECP_GROUP_LOAD_ALT )
int _mbedtls_ecp_group_load( mbedtls_ecp_group *grp, mbedtls_ecp_group_id id );

/*
 * Set a group using well-known domain parameters
 */
int mbedtls_ecp_group_load( mbedtls_ecp_group *grp, mbedtls_ecp_group_id id )
{
    int ret = _mbedtls_ecp_group_load( grp, id );

    if (ret == 0)
    {
        /* Set device instance to 0 by default. */
        ret = mbedtls_ecp_set_device_instance(grp, 0);
    }
    return ret;
}
#endif /* #if defined( MBEDTLS_ECP_GROUP_LOAD_ALT ) */

/*
 *   Set the device instance of an ECP group context.
 */
int mbedtls_ecp_set_device_instance(mbedtls_ecp_group *grp,
                                    unsigned int       devno)
{
#if defined(CRYPTO_COUNT) && (CRYPTO_COUNT > 0)
    if (devno > CRYPTO_COUNT)
        return( MBEDTLS_ERR_ECP_BAD_INPUT_DATA );
  
    return cryptodrvSetDeviceInstance( &grp->cryptodrv_ctx,
                                       devno );
#endif /* #if defined(CRYPTO_COUNT) && (CRYPTO_COUNT > 0) */
}

/**
 * @brief
 *   Check if CRYPTO supports acceleration of given ecc curve.
 ******************************************************************************/
bool mbedtls_ecp_device_grp_capable( const mbedtls_ecp_group *grp )
{
#if defined( MBEDTLS_MPI_MUL_MPI_ALT ) || defined( MBEDTLS_MPI_MUL_INT_ALT )
    CRYPTODRV_Context_t* p_cryptodrv_ctx =
      (CRYPTODRV_Context_t*)&grp->cryptodrv_ctx;
    CRYPTO_TypeDef*      crypto = p_cryptodrv_ctx->device->crypto;
#endif
    switch( grp->id )
    {
#if defined(MBEDTLS_ECP_DP_SECP192R1_ENABLED)
        case MBEDTLS_ECP_DP_SECP192R1:
#if defined( MBEDTLS_MPI_MUL_MPI_ALT ) || defined( MBEDTLS_MPI_MUL_INT_ALT )
            /* Need to reset operand width and result width if CRYPTO has been
               used for MPI acceleration since initialization. */
            CRYPTO_MulOperandWidthSet( crypto, cryptoMulOperandModulusBits );
            CRYPTO_ResultWidthSet( crypto, cryptoResult256Bits );
#endif
            return( true );
#endif /* MBEDTLS_ECP_DP_SECP192R1_ENABLED */

#if defined(MBEDTLS_ECP_DP_SECP224R1_ENABLED)
        case MBEDTLS_ECP_DP_SECP224R1:
#if defined( MBEDTLS_MPI_MUL_MPI_ALT ) || defined( MBEDTLS_MPI_MUL_INT_ALT )
            /* Need to reset operand width and result width if CRYPTO has been
               used for MPI acceleration since initialization. */
            CRYPTO_MulOperandWidthSet( crypto, cryptoMulOperandModulusBits );
            CRYPTO_ResultWidthSet( crypto, cryptoResult256Bits );
#endif
            return( true );
#endif /* MBEDTLS_ECP_DP_SECP224R1_ENABLED */

