ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/slcl_ecp.c
#if defined(MBEDTLS_ECP_DP_SECP256R1_ENABLED)
        case MBEDTLS_ECP_DP_SECP256R1:
#if defined( MBEDTLS_MPI_MUL_MPI_ALT ) || defined( MBEDTLS_MPI_MUL_INT_ALT )
            /* Need to reset operand width and result width if CRYPTO has been
               used for MPI acceleration since initialization. */
            CRYPTO_MulOperandWidthSet( crypto, cryptoMulOperandModulusBits );
            CRYPTO_ResultWidthSet( crypto, cryptoResult260Bits );
#endif
            return( true );
#endif /* MBEDTLS_ECP_DP_SECP256R1_ENABLED */

        default:
            return( false );
    }
}

/***************************************************************************//**
 * @brief
 *   Enable CRYPTO by setting up control registers for given ecc curve.
 ******************************************************************************/
int mbedtls_ecp_device_init( const mbedtls_ecp_group *grp )
{
    int ret = 0;
    CRYPTODRV_Context_t* p_cryptodrv_ctx =
      (CRYPTODRV_Context_t*)&grp->cryptodrv_ctx;
    CRYPTO_TypeDef*      crypto = p_cryptodrv_ctx->device->crypto;
    Ecode_t status = CRYPTODRV_Arbitrate(p_cryptodrv_ctx);
    if (ECODE_OK != status)
      return status;
    
    CRYPTODRV_EnterCriticalRegion(p_cryptodrv_ctx);

    /* Setup CRYPTO registers for ECC operation */
#if defined( MBEDTLS_INCLUDE_IO_MODE_DMA )
    crypto->CTRL     = 0;
    crypto->SEQCTRL  = 0;
#else
    crypto->CTRL     = CRYPTO_CTRL_DMA0RSEL_DDATA0;
    crypto->SEQCTRL  = CRYPTO_SEQCTRL_BLOCKSIZE_32BYTES | 32;
#endif
    crypto->SEQCTRLB = 0;

    switch( grp->id )
    {
#if defined(MBEDTLS_ECP_DP_SECP192R1_ENABLED)
        case MBEDTLS_ECP_DP_SECP192R1:
            CRYPTO_ModulusSet( crypto, cryptoModulusEccP192 );
            CRYPTO_MulOperandWidthSet( crypto, cryptoMulOperandModulusBits );
            CRYPTO_ResultWidthSet( crypto, cryptoResult256Bits );
        break;
#endif /* MBEDTLS_ECP_DP_SECP192R1_ENABLED */

#if defined(MBEDTLS_ECP_DP_SECP224R1_ENABLED)
        case MBEDTLS_ECP_DP_SECP224R1:
            CRYPTO_ModulusSet( crypto, cryptoModulusEccP224 );
            CRYPTO_MulOperandWidthSet( crypto, cryptoMulOperandModulusBits );
            CRYPTO_ResultWidthSet( crypto, cryptoResult256Bits );
        break;
#endif /* MBEDTLS_ECP_DP_SECP224R1_ENABLED */

#if defined(MBEDTLS_ECP_DP_SECP256R1_ENABLED)
        case MBEDTLS_ECP_DP_SECP256R1:
            CRYPTO_ModulusSet( crypto, cryptoModulusEccP256 );
            CRYPTO_MulOperandWidthSet( crypto, cryptoMulOperandModulusBits );
            CRYPTO_ResultWidthSet( crypto, cryptoResult260Bits );
        break;
#endif /* MBEDTLS_ECP_DP_SECP256R1_ENABLED */

        default:
            ret = MBEDTLS_ERR_ECP_FEATURE_UNAVAILABLE;
        break;
    }
    
    CRYPTODRV_ExitCriticalRegion(p_cryptodrv_ctx);
    
    return ret;
}

/***************************************************************************//**
 * @brief
 *   Disable CRYPTO by turning off clock (unless needed by mpi apis separately.)
 ******************************************************************************/
int mbedtls_ecp_device_deinit( const mbedtls_ecp_group *grp )
{
    CRYPTODRV_Context_t* p_cryptodrv_ctx =
      (CRYPTODRV_Context_t*)&grp->cryptodrv_ctx;
    Ecode_t status = CRYPTODRV_Release(p_cryptodrv_ctx);
    return ECODE_OK != status ? status : 0;
}

/***************************************************************************//**
 * @brief
 *   Write 256 bits of data to a DDATAX register in the CRYPTO module.
 *
 * @details
 *   Write 256 bits of data into a DDATAX (Double Data) register in the crypto
 *   module.
 *
 *  @param[in]  ddataReg   Data register identifier
 *  @param[in]  val        Value of the data to write to the DDATA register.
 ******************************************************************************/
__STATIC_INLINE void ecp_crypto_ddata_write(CRYPTO_DDataReg_TypeDef  ddataReg,
                                            const mbedtls_mpi*       mpi)
{
  uint32_t volatile* regPtr = (volatile uint32_t *) ddataReg;
  uint32_t* pVal = mpi->p;
  register uint32_t v0;
  register uint32_t v1;
  register uint32_t v2;
  register uint32_t v3;
  int      i;
  
  if (mpi->n <4)
  {
    /* Non optimal write of data. */
    for (i=0; i<(int)mpi->n; i++)
      *regPtr = *pVal++;
    for (; i<8; i++)
      *regPtr = 0;
  }
  else
  {
    if (mpi->n < 8)
    {
      /* Optimal write of first 4 words. */
      v0 = *pVal++;
      v1 = *pVal++;
      v2 = *pVal++;
      v3 = *pVal++;
      *regPtr = v0;
      *regPtr = v1;
      *regPtr = v2;
      *regPtr = v3;

      /* Non optimal write of remaining words */
      for (i=4; i<(int)mpi->n; i++)
        *regPtr = *pVal++;
      for (; i<8; i++)
        *regPtr = 0;
    }
    else
    {
      /* Optimal write of all data. */
      v0 = *pVal++;
      v1 = *pVal++;
      v2 = *pVal++;
      v3 = *pVal++;
      *regPtr = v0;
      *regPtr = v1;
      *regPtr = v2;
      *regPtr = v3;
      
      v0 = *pVal++;
      v1 = *pVal++;
      v2 = *pVal++;
      v3 = *pVal++;
      *regPtr = v0;
      *regPtr = v1;
      *regPtr = v2;
      *regPtr = v3;
    }
  }
}

/***************************************************************************//**
 * @brief
 *   Read 256 bits of data from a DDATAX register in the CRYPTO module.
 *
 * @details
 *   Read 256 bits of data from a DDATAX (Double Data) register in the crypto
 *   module.
 *
 *  @param[in]  ddataReg   Data register identifier
 *  @param[out] val        Location where to store the value in memory.
 ******************************************************************************/

__STATIC_INLINE int ecp_crypto_ddata_read(CRYPTO_DDataReg_TypeDef  ddataReg,
                                          mbedtls_mpi*             mpi)
{
  CRYPTO_DData_TypeDef  ddata;
  uint32_t              val32;
  int                   i;
  int                   used;
  int                   ret = 0;

  if (mpi->n == 8)
  {
    CRYPTO_DDataRead(ddataReg, mpi->p);
  }
  else
  {
    if (mpi->n > 8)
    {
      CRYPTO_DDataRead(ddataReg, mpi->p);
      memset(&mpi->p[8], 0, sizeof(uint32_t)*(mpi->n-8));
    }
    else
    {
      uint32_t volatile* regPtr = (volatile uint32_t*) ddataReg;
      used = 0;
      for (i=0; i<8; i++)
      {
        ddata[i] = val32 = *regPtr;
        if (val32)
          used = i+1;
      }
      if (used > (int)mpi->n)
      {
        MBEDTLS_MPI_CHK( mbedtls_mpi_grow(mpi, used) );
        memcpy(mpi->p, ddata, used*sizeof(uint32_t));
        mpi->s = 1;
      }
      else
      {
        memcpy(mpi->p, ddata, mpi->n*sizeof(uint32_t));
      }
    }
  }
 cleanup:
  return( ret );
}

#if defined(MBEDTLS_ECP_DOUBLE_JAC_ALT)
/*
 * Alternative implementation of ecp_double_jac using CRYPTO hardware
 * acceleration.
 *
 * Point doubling R = 2 P, Jacobian coordinates
 *
 * Based on Section 3.2.4 in "Introduction to Identity-Based Encryption"
 * by Martin Luther
 *
 * Cost: 1D := 4M + 4S          (A == -3)
 *             
 */
int ecp_device_double_jac( const mbedtls_ecp_group *grp,
                                 mbedtls_ecp_point *R,
                           const mbedtls_ecp_point *P )
{
    int          ret;
    CRYPTODRV_Context_t* p_cryptodrv_ctx =
       (CRYPTODRV_Context_t*)&grp->cryptodrv_ctx;
    CRYPTO_TypeDef*      crypto = p_cryptodrv_ctx->device->crypto;
    CRYPTODRV_EnterCriticalRegion(p_cryptodrv_ctx);

#if !defined( MBEDTLS_INCLUDE_IO_MODE_DMA )
    
    ecc_bigint_t _2YY;
    /*
      STEP 1:
           
      Goals:
      ZZ   = Z^2
      R->Z = 2 * Y * Z
      YY   = Y^2
      4YY  = 4 * Y^2
      
      Write Operations:
      
      R2 = Y
      R3 = Z
      
      Instructions to be executed:
      
      1.  R0 = DMA = Z
      2.  R1 = R0 = Z
      3.  R2 = R0 = Z
      4.  Select R1, R2
      5.  R0 = R1 * R2 = Z^2 = ZZ 
      6.  R3 = R0 = ZZ
      
      7.  R0 = DMA = Y
      8.  R2 = R0 = Y
      9.  R0 = R1 * R2 = Y * Z
      10. Select R0, R0
      11. R0 = R0 + R0 = 2 * Y * Z = R->Z
      
      12. DMA = R0 = R->Z
      
      13. R1 = R2 = Y
      14. Select R1, R2
      15. R0 = R1 * R2 = Y^2 = YY
      16.  Select R0, R0
      17.  R0 = R0 + R0 = 2YY
      
