ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/slcl_ecp.c
                      CRYPTO_CMD_INSTR_SELDDATA3DDATA2,
                      CRYPTO_CMD_INSTR_MSUB
                      );
    CRYPTO_DDataWrite(&crypto->DDATA0, _2YY);
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA0, &R->Y) );
    
#else  /* #if !defined( MBEDTLS_INCLUDE_IO_MODE_DMA ) */
    
    ecc_bigint_t A;
    ecc_bigint_t B;
    ecc_bigint_t _2A;  /* Represents 2A */
    
    /*
      
      Goals:
      B    = 8 * Y1^4
      Y1Y1 = Y1²
      
      Write Operations:
      
      R1 = Y1
      
      Instructions to be executed:
      
      1. R2 = R1 = Y1
      2. Select R1, R2
      3. R0 = R1 * R2 = Y1² = Y1Y1
      4. R1 = R0 = Y1²
      5. R2 = R0 = Y1²
      6. R0 = R1 * R2 = Y1^4
      7. Select R0, R0
      8. R0 = R0 + R0 = 2 * Y1^4
      9. R0 = R0 + R0 = 4 * Y1^4
      10 R0 = R0 + R0 = 8 * Y1^4
      
      Read Operations:     
      
      B    = R0 = 8 * Y1^4
      Y1Y1 = R1 = Y1²
      
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA1, &P->Y);
    
    CRYPTO_EXECUTE_10(crypto,
                      CRYPTO_CMD_INSTR_DDATA1TODDATA2,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                      CRYPTO_CMD_INSTR_MADD,
                      CRYPTO_CMD_INSTR_MADD,
                      CRYPTO_CMD_INSTR_MADD
                      );
    
    CRYPTO_DDataRead(&crypto->DDATA0, B);
    
    /*
      Goals:
      A   = 4P1->X * Y1Y1
      _2A  = 2A
      
      Write Operations:
      
      R0 = P1->X
      R1 = Y1Y1       R1 already contains Y1Y1
      
      Instructions to be executed:
      
      1.  Select R0, R0
      2.  R0 = R0 + R0 = 2P1->X
      3.  R0 = R0 + R0 = 4P1->X
      4.  R3 = R0 = 4P1->X
      5.  Select R1, R3
      6.  R0 = R1 * R3 = 4P1->X * Y1Y1 = A
      7.  R3 = R0
      8.  Select R0, R3
      9.  R0 = R0 + R3 = 2A = _2A
      
      Read Operations:     
      
      A    = R3 = 4P1->X + Y1Y1
      _2A  = R0 = 2A
      
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA0, &P->X);
    
    CRYPTO_EXECUTE_9(crypto,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                     CRYPTO_CMD_INSTR_MADD,
                     CRYPTO_CMD_INSTR_MADD,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                     CRYPTO_CMD_INSTR_MMUL,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                     CRYPTO_CMD_INSTR_MADD
                     );
  
    CRYPTO_DDataRead(&crypto->DDATA3, A);
    CRYPTO_DDataRead(&crypto->DDATA0, _2A);
    
    /*
      Goals: Z1Z1 = P1->Z²
  
      Write Operations:
  
      R1 = P1->Z
      
      Instructions to be executed:
      
      1. R2 = R1 = P1->Z
      2. Select R1, R2
      3. R0 = R1 * R2 = P1->Z^² = Z1Z1 
      4. R3 = R0 = Z1Z1
      
      Read Operations:     
      
      Z1Z1 = R0 = P1->Z²
      
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA1, &P->Z);
    
    CRYPTO_EXECUTE_4(crypto,
                     CRYPTO_CMD_INSTR_DDATA1TODDATA2,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                     CRYPTO_CMD_INSTR_MMUL,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA3
                     );
  
    /*
      Goal: C = 3(P1->X - Z1Z1)(P1->X + Z1Z1)
  
      Write Operations:
      
      R2 = P1->X
      R3 = Z1Z1    Z1Z1 is already in R3   
      
      Instructions to be executed:
      
      1.  Select R2, R3
      2.  R0 = R2 + R3 = P1->X + Z1Z1
      3.  R1 = R0 = P1->X + Z1Z1
      4.  R0 = R2 - R3 = P1->X - Z1Z1
      5.  R2 = R0 = P1->X - Z1Z1
      6.  Select R1, R2
      7.  R0 = R1 * R2 = (P1->X + Z1Z1)(P1->X - Z1Z1)
      8.  R1 = R0 = (P1->X + Z1Z1)(P1->X - Z1Z1)
      9.  Select R0, R1
      10. R0 = R0 + R1 = 2(P1->X + Z1Z1)(P1->X - Z1Z1)
      11. R0 = R0 + R1 = 3(P1->X + Z1Z1)(P1->X - Z1Z1) = C
      12. R1 = R0 = C 
      
      Read Operations:     
      
      C = R1 = 3(P1->X - Z1Z1)(P1->X + Z1Z1)
      
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA2, &P->X);
    
    CRYPTO_EXECUTE_12(crypto,
                      CRYPTO_CMD_INSTR_SELDDATA2DDATA3,
                      CRYPTO_CMD_INSTR_MADD,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA0DDATA1,
                      CRYPTO_CMD_INSTR_MADD,
                      CRYPTO_CMD_INSTR_MADD,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1
                      );
    
    /*
      Goals: R->X = C² - _2A
      D = C(A - R->X)
      
      Write Operations:
      
      R1 = C          R1 already contains C
      R2 = _2A
      R3 = A
      R4 = C
      
      Instructions to be executed:
      
      1.  R4 = R1 = C
      2.  Select R1, R4
      3.  R0 = R1 * R4 = C²
      4.  Select R0, R2
      5.  R0 = R0 - R2 = C² - _2A = R->X
      6.  R4 = R0 = R->X
      7.  Select R3, R4
      8.  R0 = R3 - R4 = A - R->X
      9.  R2 = R0 = A - R->X
      10  Select R1, R2
      11. R0 = R1 * R2 = C(A - R->X) = D
      
      Read Operations:     
  
      D  = R0 = C(A - R->X)
      R->X = R4 = C² - _2A
      
    */

    CRYPTO_DDataWrite(&crypto->DDATA2, _2A);
    CRYPTO_DDataWrite(&crypto->DDATA3, A);
    
    CRYPTO_EXECUTE_11(crypto,
                      CRYPTO_CMD_INSTR_DDATA1TODDATA4,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                      CRYPTO_CMD_INSTR_SELDDATA3DDATA4,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL
                      );
    
