ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/slcl_ecp.c
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA4, &R->X) );
    
    /*
      Goals: R->Y = D - B
      R->Z = 2 * Y1 * P1->Z
      
      Write Operations:
      
      R0 = D         R0 already contains D
      R1 = Y1          
      R2 = P1->Z
      R3 = B
      
      Instructions to be executed:
      
      1.  Select R0, R3
      2.  R0 = R0 - R3 = D - B = R->Y
      3.  R3 = R0 = R->Y
      4.  Select R1, R2
      5.  R0 = R1 * R2 = Y1 * P1->Z
      6.  Select R0, R0
      7.  R0 = R0 + R0 = 2 * Y1 * P1->Z = R->Z
      
      Read Operations:     
      
      R->Z = R0 = 2*Y1*P1->Z
      R->Y = R3 = D - B
      
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA1, &P->Y);
    ecp_crypto_ddata_write(&crypto->DDATA2, &P->Z);
    CRYPTO_DDataWrite(&crypto->DDATA3, B);
    
    CRYPTO_EXECUTE_7(crypto,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                     CRYPTO_CMD_INSTR_MSUB,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                     CRYPTO_CMD_INSTR_MMUL,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                     CRYPTO_CMD_INSTR_MADD
                     );
    
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA0, &R->Z) );
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA3, &R->Y) );
    
#endif  /* #if !defined( MBEDTLS_INCLUDE_IO_MODE_DMA ) */
    
 cleanup:
  
  CRYPTODRV_ExitCriticalRegion(p_cryptodrv_ctx);
  
  return( ret );
}
#endif /* #if defined(MBEDTLS_ECP_DOUBLE_JAC_ALT) */

#if defined(MBEDTLS_ECP_DEVICE_ADD_MIXED_ALT)
/*
 * Alternative implementation of ecp_add_mixed using CRYPTO hardware
 * acceleration.
 *
 * Addition: R = P + Q, mixed affine-Jacobian coordinates (GECC 3.22)
 *
 * The coordinates of Q must be normalized (= affine),
 * but those of P don't need to. R is not normalized.
 *
 * We accept Q->Z being unset (saving memory in tables) as meaning 1.
 *
 * Cost: 1A := 8M + 3S
 */
int ecp_device_add_mixed( const mbedtls_ecp_group *grp, mbedtls_ecp_point *R,
                          const mbedtls_ecp_point *P, const mbedtls_ecp_point *Q )
{
    int    ret;
    CRYPTODRV_Context_t* p_cryptodrv_ctx =
        (CRYPTODRV_Context_t*)&grp->cryptodrv_ctx;
    CRYPTO_TypeDef*      crypto = p_cryptodrv_ctx->device->crypto;
    CRYPTODRV_EnterCriticalRegion(p_cryptodrv_ctx);

#if !defined( MBEDTLS_INCLUDE_IO_MODE_DMA )
    
    /*
      STEP 1:
      
      Goals:
      A = Qx*Pz^2
      B = Qy*Pz^3
      
      Write Operations:
      
      R0 = Pz
      R0 = Qx
      R0 = Qy
      
      Instructions to be executed:
      
      1. R0 = DMA = Pz
      2. R1 = R0 = Pz
      3. R2 = R0 = Pz
      4. Select R1, R2
      5. R0 = R1 * R2 = Pz^2
      6. R1 = R0 = Pz^2
      
      7.  R0 = DMA = Qx
      8.  R3 = R0 = Qx
      9.  Select R1, R3
      10. R0 = R1 * R3 = Qx * Pz^2
      11. R3 = R0 = Qx * Pz^2
      
      12. Select R1, R2
      13. R0 = R1 * R2 = Pz^3
      14. R1 = R0 = Pz^3
      
      15. R0 = DMA = Qy
      16. R4 = R0 = Qx
      17. Select R1, R4
      18. R0 = R1 * R4 = Qy * Pz^3
      19. Select R0, R1  (for MSUB in step 2)
      
      Output State:
      R0   = B
      R1   = FREE
      R2   = FREE
      R3   = A
      R4   = Pz
      
      STEP 1:
    */
    CRYPTO_EXECUTE_19(crypto,
                      CRYPTO_CMD_INSTR_DMA0TODATA,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      
                      CRYPTO_CMD_INSTR_DMA0TODATA,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                      
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      
                      CRYPTO_CMD_INSTR_DMA0TODATA,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_SELDDATA0DDATA1
                      );
    ecp_crypto_ddata_write(&crypto->DDATA0, &P->Z);
    ecp_crypto_ddata_write(&crypto->DDATA0, &Q->X);
    ecp_crypto_ddata_write(&crypto->DDATA0, &Q->Y);
    
    /*
      STEP 2:
      
      Goals:
      C  = A - Px
      D  = B - Py
      R->Z = Pz * C
      
      Write Operations:
      
      R1 = Py
      R0 = Px (via DMA)
      
      Input State:
      R0   = B
      R1   = Py
      R2   = FREE
      R3   = A
      R4   = Pz
      
      Instructions to be executed:
      
      1. R0 = R0 - R2 = B - Py = D
      2. R2 = R0 = D
      3. R1 = R3 = A
      4. R0 = DMA = Px
      5. R3 = R0 = Px
      6. Select R1, R3
      7. R0 = R1 - R3 = A - Px = C
      8. R1 = R0 = C
      9. Select R1, R4
      10. R0 = R1 * R4 = Pz * C = R->Z
      11. R4 = R1 = C
      
      Read Operations:     
      
      R->Z = R0 = Pz * C
      
      Output State:
      R0   = FREE
      R1   = C
      R2   = D
      R3   = Px
      R4   = FREE
      
      STEP 2:
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA1, &P->Y);
    CRYPTO_EXECUTE_11(crypto,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA2, /* R2 = D */
                      
                      CRYPTO_CMD_INSTR_DDATA3TODDATA1,
                      CRYPTO_CMD_INSTR_DMA0TODATA,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,  /* R1 = C */
                      
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA1TODDATA4
                      );
    ecp_crypto_ddata_write(&crypto->DDATA0, &P->X);
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA0, &R->Z) );
    
