ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/slcl_ecp.c
    /*
      STEP 3:
      
      Goals:
      X1C2  = Px * C^2
      C3    = C^3
      D2    = D^2
      
      Input State:
      R0   = FREE
      R1   = C
      R2   = D
      R3   = Px
      R4   = FREE
      
      Instructions to be executed:
      
      1. R0 = R1 * R4 = C^2
      2. R1 = R0 = C^2
      3. R0 = R1 * R4 = C^3
      4. R4 = R0 = C^3
      5. Select R1, R3
      6. R0 = R1 * R3 = Px * C^2
      7. R3 = R0 = Px * C^2
      8. R1 = R2 = D
      9. Select R1, R1
      10. R0 = R1 * R1 = D^2
      11. Select R0, R4   (for MSUB operation in next sequence)
      
      Output state:
      
      R0 = D2
      R1 = FREE
      R2 = D
      R3 = X1C2 = Px * C^2
      R4 = C3   = C^3
      
      STEP 3:
    */
    CRYPTO_EXECUTE_11(crypto,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                      CRYPTO_CMD_INSTR_DDATA2TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_SELDDATA0DDATA4
                      );
    /*
      STEP 3:
      
      Goals:
      R->X   = D2 - (C3 + 2 * X1C2) = D2 - C3 - X1C2- X1C2
      Y1C3 = Py * C3
      R->Y = D * (X1C2 - R->X) - Y1C3
      
      Write Operations:
      R1 = Py
      
      Input State:  
      R0 = D2
      R1 = FREE
      R2 = D
      R3 = X1C2
      R4 = C3
      
      Instructions to be executed:
      
      1.  R0 = R0 - R4 = D2 - C3
      2.  Select R0, R3
      3.  R0 = R0 - R3 = D2 - C3 - X1C2
      4.  R0 = R0 - R3 = D2 - C3 - X1C2 - X1C2 = R->X
      5.  DMA = R0 = R->X
      6.  R1 = R0 = R->X
      
      7.  Select R3, R1
      8.  R0 = R3 - R1 = X1C2 - R->X
      9.  R1 = R0 = X1C2 - R->X
      10. Select R1, R2
      11. R0 = R1 * R2 = D *(X1C2 - R->X)
      12. R2 = R0
      
      13. R0 = DMA = Py
      14. R1 = R0 = Py
      15. Select R1, R4
      16. R0 = R1 * R4 = Py * C3 = Y1C3
      17. R4 = R0 = Y1C3
      
      18. Select R2, R4
      19. R0 = R2 - R4 
      
      Read Operations:     
      
      R->X = R2 = D2 - (C3 + 2 * X1C2)
      R->Y = R0 = D * (X1C2 - R->X) - Y1C3
      
      STEP 4:
    */
    
    CRYPTO_EXECUTE_19(crypto,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_DATATODMA0,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      
                      CRYPTO_CMD_INSTR_SELDDATA3DDATA1,
                      CRYPTO_CMD_INSTR_MSUB,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                      
                      CRYPTO_CMD_INSTR_DMA0TODATA,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                      
                      CRYPTO_CMD_INSTR_SELDDATA2DDATA4,
                      CRYPTO_CMD_INSTR_MSUB
                      );
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA0, &R->X) );
    ecp_crypto_ddata_write(&crypto->DDATA0, &P->Y);
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA0, &R->Y) );
    
#else /* #if !defined( MBEDTLS_INCLUDE_IO_MODE_DMA ) */

    const mbedtls_mpi* Px = &P->X;
    const mbedtls_mpi* Py = &P->Y;
    const mbedtls_mpi* Pz = &P->Z;
    const mbedtls_mpi* Qx = &Q->X;
    const mbedtls_mpi* Qy = &Q->Y;
    ecc_bigint_t       D;
    
    /*
      
      Goals:
      A = Qx*Pz^2
      B = Qy*Pz^3
      
      Write Operations:
      
      R1 = Pz
      R3 = Qx
      R4 = Qy
      
      Instructions to be executed:
      
      1. R2 = R1 = Pz
      2. Select R1, R2
      2. R0 = R1 * R2 = Pz^2
      3. R1 = R0 = Pz^2
      4. Select R1, R3
      5. R0 = R1 * R3 = Qx * Pz^2
      6. R3 = R0 = Qx * Pz^2
      7. Select R1, R2
      8. R0 = R1 * R2 = Pz^3
      1  9. R1 = R0 = Pz^3
      10.Select R1, R4
      11.R0 = R1 * R4 = Qy * Pz^3
      
      Read Operations:     
      
      B = R0 = Qy*Pz^3
      A = R3 = Qx*Pz^2
      
      STEP 1:
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA1, Pz);
    ecp_crypto_ddata_write(&crypto->DDATA3, Qx);
    ecp_crypto_ddata_write(&crypto->DDATA4, Qy);
    
    CRYPTO_EXECUTE_12(crypto,
                      CRYPTO_CMD_INSTR_DDATA1TODDATA2,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL
                      );
    
    /*
      
      Goals: C  = A - Px
      D  = B - Py
      R->Z = Pz * C
      
      Write Operations:
      
      R0 = B         B is already in R0
      R1 = Px
      R2 = Py
      R3 = A         A is already in R3
      R4 = Pz
      
      Instructions to be executed:
      
      1. Select R0, R2
      2. R0 = R0 - R2 = B - Py = D
      3. R2 = R0 = D
      4. Select R3, R1
      5. R0 = R3 - R1 = A - Px = C
      6. R1 = R0 = C
      7. Select R1, R4
      8. R0 = R1 * R4 = Pz * C = R->Z
      
      Read Operations:     
      
