ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/slcl_ecp.c
      R->Z = R0 = Pz * C
      C  = R1 = A - Px
      D  = R2 = B - Py
      
      STEP 2:
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA1, Px);
    ecp_crypto_ddata_write(&crypto->DDATA2, Py);
    ecp_crypto_ddata_write(&crypto->DDATA4, Pz);
    
    CRYPTO_EXECUTE_8(crypto,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                     CRYPTO_CMD_INSTR_MSUB,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                     CRYPTO_CMD_INSTR_SELDDATA3DDATA1,
                     CRYPTO_CMD_INSTR_MSUB,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                     CRYPTO_CMD_INSTR_MMUL
                     );
    
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA0, &R->Z) );
    CRYPTO_DDataRead(&crypto->DDATA2, D);
    
    /*
      
      Goals: X1C2  = Px * C²
      C3    = C³
      D2    = D²
      
      Write Operations:
      
      R1 = C         C is already in R1
      R2 = D         D is already in R2
      R3 = Px
      
      R4 = C
      
      Instructions to be executed:
      
      1. Select R1, R4
      2. R0 = R1 * R4 = C²
      3. R1 = R0 = C²
      4. R0 = R1 * R4 = C³
      5. R4 = R0 = C³
      6. Select R1, R3
      7. R0 = R1 * R3 = Px * C^²
      8. R3 = R0 = Px * C²
      9. R1 = R2 = D
      10. Select R1, R1
      11. R0 = R1 * R1 = D²
      
      Read Operations:     
      
      D2   = R0 = D²
      X1C2 = R3 = Px * C²
      C3   = R4 = C³
  
      STEP 3:
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA3, Px);
    CRYPTO_EXECUTE_12(crypto,
                      CRYPTO_CMD_INSTR_DDATA1TODDATA4,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                      CRYPTO_CMD_INSTR_DDATA2TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL
                      );

    /*
      Goals: R->X   = D2 - (C3 + 2 * X1C2) = D2 - C3 - X1C2- X1C2
      Y1C3 = Py * C3
      
      Write Operations:
      
      R0 = D2        D2 is already in R0
      R1 = Py
      R3 = X1C2      X1C2 is already in R3
      R4 = C3        C3 is already in R4
      
      Instructions to be executed:
      
      1. Select R0, R4
      2. R0 = R0 - R4 = D2 - C3
      3. Select R0, R3
      4. R0 = R0 - R3 = D2 - C3 - X1C2
      5. R0 = R0 - R3 = D2 - C3 - X1C2 - X1C2 = R->X
      6. R2 = R0 = R->X
      7. Select R1, R4
      8. R0 = R1 * R4 = Py * C3 = Y1C3
      
      Read Operations:     
      
      Y1C3 = R0 = Py * C³
      R->X   = R2 = D2 - (C3 + 2 * X1C2)
      
      STEP 4:
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA1, Py);
    
    CRYPTO_EXECUTE_8(crypto,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA4,
                     CRYPTO_CMD_INSTR_MSUB,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                     CRYPTO_CMD_INSTR_MSUB,
                     CRYPTO_CMD_INSTR_MSUB,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                     CRYPTO_CMD_INSTR_MMUL
                     );
    
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA2, &R->X) );
    
    /*
      Goal: R->Y = D * (X1C2 - R->X) - Y1C3
      
      Write Operations:
  
      R1 = D 
      R2 = R->X        R->X is already in R2
      R3 = X1C2      X1C2 is already in R3
      R4 = Y1C3      
      
      Instructions to be executed:
      
      1. Select R3, R2
      2. R0 = R3 - R2 = X1C2 - R->X
      3. R2 = R0 = X1C2 - R->X
      4. Select R1, R2
      5. R0 = R1 * R2 = D *(X1C2 - R->X)
      6. Select R0, R4
      7. R0 = R0 - R4
      
      Read Operations:     
      
      R->Y= R0 = D * (X1C2 - R->X) - Y1C3
      
      STEP 5:
    */  
    
    CRYPTO_DDataWrite(&crypto->DDATA1, D);
    CRYPTO_EXECUTE_8(crypto,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA4,
                     CRYPTO_CMD_INSTR_SELDDATA3DDATA2,
                     CRYPTO_CMD_INSTR_MSUB,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                     CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                     CRYPTO_CMD_INSTR_MMUL,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA4,
                     CRYPTO_CMD_INSTR_MSUB
                     );
    
    MBEDTLS_MPI_CHK( ecp_crypto_ddata_read(&crypto->DDATA0, &R->Y) );

#endif /* #if !defined( MBEDTLS_INCLUDE_IO_MODE_DMA ) */
  
 cleanup:
  
  CRYPTODRV_ExitCriticalRegion(p_cryptodrv_ctx);
  
  return( ret );
}
#endif /* #if defined(MBEDTLS_ECP_DEVICE_ADD_MIXED_ALT) */

#if defined(MBEDTLS_MPI_MODULAR_DIVISION_ALT)
/***************************************************************************//**
 * @brief
 *   Modular division using CRYPTO hardware acceleration.
 *
 * @details
 *   This function computes R = X/Y mod(N) using CRYPTO hardware acceleration.
 *   The implementation is not a direct replacement plugin, i.e. alternative
 *   implementation, of an existing mbedtls function. This function is used
 *   internally in other CRYPTO plugin functions indirectly replacing
 *   mbedtls_mpi_inv_mod.
 *
 *  @param[in]  X        Dividend of modular division operation
 *  @param[in]  Y        Divisor of  modular division operation
 *  @param[in]  N        Modulus
 *  @param[out] R        The destination of the result
 *
 * @return N/A
 ******************************************************************************/
static void mbedtls_mpi_div_mod(CRYPTO_TypeDef* crypto,
                                ecc_bigint_t    X,
                                ecc_bigint_t    Y,
                                ecc_bigint_t    N,
                                ecc_bigint_t    R)
{
    uint32_t            D[9];
    uint32_t            status_reg;
    uint8_t             rdata;
    uint8_t             lsb_C;
    uint8_t             lsb_D;
    uint8_t             lsb_U;
    int                 t;
    int                 k;

    /************** Initialize and organize data in crypto module **************/

