ARMmbed/mbed-os/targets/TARGET_Silicon_Labs/TARGET_EFM32/sl_crypto/src/slcl_ecp.c
                    CRYPTO_DDATA0_260_BITS_WRITE(crypto, D);
                    crypto->CMD = CRYPTO_CMD_INSTR_DDATA0TODDATA3;
                    
                } /* if (k == -1) */
            }        
        } /* else: !if((C[31:0] & 0x1) == 0x0) */
           
        crypto->CMD = CRYPTO_CMD_INSTR_DDATA2TODDATA0;
    
        lsb_U = CRYPTO_DData0_4LSBitsRead(crypto);

        /* if ((U[31:0] & 0x1) == 0x1) */
        if((lsb_U & 0x1) == 0x1)
        {
#if defined( MBEDTLS_INCLUDE_IO_MODE_DMA )
            CRYPTO_EXECUTE_3(crypto,
                             CRYPTO_CMD_INSTR_SELDDATA2DDATA2,
                             CRYPTO_CMD_INSTR_SHRA,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA2
                             );

            CRYPTO_DDataWrite(&crypto->DDATA0, N);
            CRYPTO_EXECUTE_6(crypto,
                             CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                             CRYPTO_CMD_INSTR_SHR,
                             CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                             CRYPTO_CMD_INSTR_CSET,
                             CRYPTO_CMD_INSTR_ADDC,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA2
                             );
#else /* #if defined( MBEDTLS_INCLUDE_IO_MODE_DMA ) */
            CRYPTO_EXECUTE_10(crypto,
                              CRYPTO_CMD_INSTR_SELDDATA2DDATA2,
                              CRYPTO_CMD_INSTR_SHRA,
                              CRYPTO_CMD_INSTR_DDATA0TODDATA2,
                              CRYPTO_CMD_INSTR_DMA0TODATA,  /* DDATA0 = N */
                              CRYPTO_CMD_INSTR_SELDDATA0DDATA0,
                              CRYPTO_CMD_INSTR_SHR,
                              CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                              CRYPTO_CMD_INSTR_CSET,
                              CRYPTO_CMD_INSTR_ADDC,
                              CRYPTO_CMD_INSTR_DDATA0TODDATA2);
        
            CRYPTO_DDataWrite(&crypto->DDATA0, N);
#endif /* #if defined( MBEDTLS_INCLUDE_IO_MODE_DMA ) */
        }
        else
        {
            CRYPTO_EXECUTE_3(crypto,
                             CRYPTO_CMD_INSTR_SELDDATA2DDATA2,
                             CRYPTO_CMD_INSTR_SHRA,
                             CRYPTO_CMD_INSTR_DDATA0TODDATA2);
        } 
        
        /* DDATA0 = C */
        crypto->CMD = CRYPTO_CMD_INSTR_DDATA1TODDATA0;
        
    } /* End of main loop:  while (C != 0)  */
    
    /* if (D == 1): */
    /* Decrement D by 1 and test if zero. */
    CRYPTO_EXECUTE_2(crypto,
                     CRYPTO_CMD_INSTR_DDATA3TODDATA0,
                     CRYPTO_CMD_INSTR_DEC);
    
    if (crypto_ddata0_is_zero(crypto, &status_reg))
    {
        CRYPTO_DDataRead(&crypto->DDATA4, R);
    }
    else
    {
        CRYPTO_DDataWrite(&crypto->DDATA0, N);
        CRYPTO_EXECUTE_2(crypto,
                         CRYPTO_CMD_INSTR_SELDDATA0DDATA4,
                         CRYPTO_CMD_INSTR_SUB
                         );
        CRYPTO_DDataRead(&crypto->DDATA0, R);
    }
    
    return;
} /* mbedtls_mpi_div_mod  */
#endif /* #if defined( MBEDTLS_MPI_MODULAR_DIVISION_ALT ) */

#if defined( MBEDTLS_ECP_NORMALIZE_JAC_ALT )
/*
 * Alternative implementation of ecp_normalize_jac using CRYPTO hardware
 * acceleration.
 *
 * Normalize jacobian coordinates so that Z == 0 || Z == 1  (GECC 3.2.1)
 */
int ecp_device_normalize_jac( const mbedtls_ecp_group *grp, mbedtls_ecp_point *P )
{
    int ret = 0;
    CRYPTODRV_Context_t* p_cryptodrv_ctx =
      (CRYPTODRV_Context_t*)&grp->cryptodrv_ctx;
    CRYPTO_TypeDef*      crypto = p_cryptodrv_ctx->device->crypto;
    CRYPTODRV_EnterCriticalRegion(p_cryptodrv_ctx);

#if defined( MBEDTLS_MPI_MODULAR_DIVISION_ALT )

    ecc_bigint_t    one;
    ecc_bigint_t    Z;
    ecc_bigint_t    modulus;
    ecc_bigint_t    Z_inv;

    memset(one, 0, sizeof(one));
    one[0]=1;

    MPI_TO_BIGINT( Z, &P->Z );
    MPI_TO_BIGINT( modulus, &grp->P );

    mbedtls_mpi_div_mod(crypto, one, Z, modulus, Z_inv);

    CRYPTO_DDataWrite(&crypto->DDATA1, Z_inv);
    
#else
    
    mbedtls_mpi Z_inv;
    mbedtls_mpi_init( &Z_inv );

    /*
     * Z_inv = 1 / Z  mod p
     */
    MBEDTLS_MPI_CHK( mbedtls_mpi_inv_mod( &Z_inv,      &P->Z,     &grp->P ) );

    ecp_crypto_ddata_write(&crypto->DDATA1, &Z_inv);
#endif
    
    /*
             
    Goals:
    R->X = P->X * Z_inv ^2
    R->Y = P->Y * Z_inv ^3
    
    Write Operations:
    
    R1 = Z_inv
    R3 = P->X
    R4 = P->Y
    
    Instructions to be executed:
    
    1.  R2 = R1 = Z_inv
    2.  Select R1, R2
    3.  R0 = R1 * R2 = Z_inv^2
    4.  R1 = R0 = Z_inv^2
    5.  Select R1, R3
    6.  R0 = R1 * R3 = P->X * Z_inv^2 = R->X
    7.  R3 = R0
    8.  Select R1, R2
    9.  R0 = R1 * R2 = Z_inv^3
    10. R1 = R0 = Z_inv^3
    11. Select R1, R4
    12. R0 = R1 * R4 = P->Y * Z_inv^3 = R->Y
    
    Read Operations:     
    
    R->Y = R0 = P->Y * P->Z_inv^3
    R->X = R3 = P->X * P->Z_inv^2
            
    */
    
    ecp_crypto_ddata_write(&crypto->DDATA3, &P->X);
    ecp_crypto_ddata_write(&crypto->DDATA4, &P->Y);
    
    CRYPTO_EXECUTE_12(crypto,
                      CRYPTO_CMD_INSTR_DDATA1TODDATA2,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA3,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA2,
                      CRYPTO_CMD_INSTR_MMUL,
                      CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                      CRYPTO_CMD_INSTR_SELDDATA1DDATA4,
                      CRYPTO_CMD_INSTR_MMUL
                      );

    ecp_crypto_ddata_read(&crypto->DDATA0, &P->Y);
    ecp_crypto_ddata_read(&crypto->DDATA3, &P->X);

    /*
     * Z = 1
     */
    MBEDTLS_MPI_CHK( mbedtls_mpi_lset( &P->Z, 1 ) );

 cleanup:

    CRYPTODRV_ExitCriticalRegion(p_cryptodrv_ctx);
  
#if !defined(MBEDTLS_MPI_MODULAR_DIVISION_ALT)
    mbedtls_mpi_free( &Z_inv );
#endif /* #if !defined(MBEDTLS_MPI_MODULAR_DIVISION_ALT) */

    return( ret );
}
#endif /* #if defined( MBEDTLS_ECP_NORMALIZE_JAC_ALT ) */

#if defined( MBEDTLS_ECP_NORMALIZE_JAC_MANY_ALT )
/*
 * Alternative implementation of ecp_normalize_jac_many using
 * CRYPTO hardware acceleration.
 *
 * Normalize jacobian coordinates of an array of (pointers to) points,
 * using Montgomery's trick to perform only one inversion mod P.
 * (See for example Cohen's "A Course in Computational Algebraic Number
 * Theory", Algorithm 10.3.4.)
 */
int ecp_device_normalize_jac_many( const mbedtls_ecp_group *grp,
                                   mbedtls_ecp_point *T[], size_t t_len )
{
    int ret;
    size_t i;
    ecc_bigint_t*   cc;
    ecc_bigint_t    uu;
    ecc_bigint_t    one;
    ecc_bigint_t    modulus;
    CRYPTODRV_Context_t* p_cryptodrv_ctx =
      (CRYPTODRV_Context_t*)&grp->cryptodrv_ctx;
    CRYPTO_TypeDef*      crypto = p_cryptodrv_ctx->device->crypto;

